NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/basic/simpleFoam/implicitAMI/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//- For laplacianFoam
DT              4e-05;

//- For simpleFoam
transportModel  Newtonian;
nu              1.5e-05;


// ************************************************************************* //
